In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv('Chennai.csv')
data['price'] = data['price'] / 100000

In [3]:
data.head()

    price  sqft        location  bathrooms  bhk            area_type
0   55.00  1310   Perungalathur        2.0    1  Super built-up Area
1   53.50  1126      Madhavaram        5.0    3            Plot Area
2   82.05  1307      Karapakkam        2.0    3        Built-up Area
3  234.00  3600  Thiruvidandhai        3.0    2  Super built-up Area
4  101.00  1700  Iyappanthangal        2.0    4  Super built-up Area

In [4]:
data.shape

(5014, 6)

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5014 entries, 0 to 5013
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   price      5014 non-null   float64
 1   sqft       5014 non-null   int64
 2   location   5014 non-null   object
 3   bathrooms  4982 non-null   float64
 4   bhk        5014 non-null   int64
 5   area_type  5014 non-null   object
dtypes: float64(2), int64(2), object(2)
memory usage: 235.2+ KB

In [6]:
for column in data.columns:
    print(data[column].value_counts())
    print("*"*20)

38.81     48
40.00     37
34.00     35
35.00     31
110.00    30
          ..
67.98      1
51.04      1
48.95      1
46.59      1
53.45      1
Name: price, Length: 2058, dtype: int64
********************
721     68
920     44
1200    36
1100    35
1123    33
        ..
362      1
2303     1
2235     1
2089     1
2015     1
Name: sqft, Length: 1217, dtype: int64
********************
Medavakkam              230
Ambattur                195
Sholinganallur          177
Karapakkam              161
Iyappanthangal          158
                       ...
Shenoy Nagar              1
Irandankattalai           1
200 Feet Radial Road      1
Shanthi Nagar             1
Royapuram                 1
Name: location, Length: 185, dtype: int64
********************
2.0     2593
3.0     1255
4.0      463
1.0      280
5.0      188
6.0       91
7.0       50
9.0       23
8.0       21
10.0       7
12.0       3
11.0       2
16.0       2
15.0       1
27.0       1
40.0       1
14.0       1
Name: bathrooms, dtype: int64
********************
3     2230
2     1585
4      586
1      493
5       61
6       26
7       11
8        8
9        7
10       4
16       1
13       1
11       1
Name: bhk, dtype: int64
********************
Super built-up Area    3290
Built-up Area           905
Plot Area               779
Carpet Area              40
Name: area_type, dtype: int64
********************

In [7]:
data.isna().sum()

price         0
sqft          0
location      0
bathrooms    32
bhk           0
area_type     0
dtype: int64

In [8]:
data.describe()

             price         sqft    bathrooms          bhk
count  5014.000000  5014.000000  4982.000000  5014.000000
mean     87.312642  1232.992022     2.719791     2.680893
std     103.426054   641.841841     1.470504     1.025063
min      20.000000   362.000000     1.000000     1.000000
25%      40.950000   865.000000     2.000000     2.000000
50%      57.820000  1067.000000     2.000000     3.000000
75%      86.750000  1438.750000     3.000000     3.000000
max    1900.000000  7240.000000    40.000000    16.000000

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5014 entries, 0 to 5013
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   price      5014 non-null   float64
 1   sqft       5014 non-null   int64
 2   location   5014 non-null   object
 3   bathrooms  4982 non-null   float64
 4   bhk        5014 non-null   int64
 5   area_type  5014 non-null   object
dtypes: float64(2), int64(2), object(2)
memory usage: 235.2+ KB

In [10]:
data['location'].value_counts()

Medavakkam              230
Ambattur                195
Sholinganallur          177
Karapakkam              161
Iyappanthangal          158
                       ...
Shenoy Nagar              1
Irandankattalai           1
200 Feet Radial Road      1
Shanthi Nagar             1
Royapuram                 1
Name: location, Length: 185, dtype: int64

In [11]:
data['location'] = data['location'].fillna('Ambattur')

In [12]:
data['bhk'].value_counts()

3     2230
2     1585
4      586
1      493
5       61
6       26
7       11
8        8
9        7
10       4
16       1
13       1
11       1
Name: bhk, dtype: int64

In [13]:
data['bhk'] = data['bhk'].fillna('2')

In [14]:
data['bathrooms'] = data['bathrooms'].fillna(data['bathrooms'].median())

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5014 entries, 0 to 5013
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   price      5014 non-null   float64
 1   sqft       5014 non-null   int64
 2   location   5014 non-null   object
 3   bathrooms  5014 non-null   float64
 4   bhk        5014 non-null   int64
 5   area_type  5014 non-null   object
dtypes: float64(2), int64(2), object(2)
memory usage: 235.2+ KB

In [16]:
data[data.bhk > 20]

Empty DataFrame
Columns: [price, sqft, location, bathrooms, bhk, area_type]
Index: []

In [17]:
data['sqft'].unique()

array([1310, 1126, 1307, ...,  705,  577,  688], dtype=int64)

In [18]:
def convertRange(x):
    temp = x.split('-')
    if len(temp) == 2:
        return (float(temp[0]) + float(temp[1]))/2
    try:
        return float(x)
    except:
        return None

In [19]:
data.head()

    price  sqft        location  bathrooms  bhk            area_type
0   55.00  1310   Perungalathur        2.0    1  Super built-up Area
1   53.50  1126      Madhavaram        5.0    3            Plot Area
2   82.05  1307      Karapakkam        2.0    3        Built-up Area
3  234.00  3600  Thiruvidandhai        3.0    2  Super built-up Area
4  101.00  1700  Iyappanthangal        2.0    4  Super built-up Area

# Price Per Square Feet

In [20]:
data['location'].value_counts()

Medavakkam              230
Ambattur                195
Sholinganallur          177
Karapakkam              161
Iyappanthangal          158
                       ...
Shenoy Nagar              1
Irandankattalai           1
200 Feet Radial Road      1
Shanthi Nagar             1
Royapuram                 1
Name: location, Length: 185, dtype: int64

In [21]:
data['location'] = data['location'].apply(lambda x: x.strip())

In [22]:
data['location']

0                       Perungalathur
1                          Madhavaram
2                          Karapakkam
3                      Thiruvidandhai
4                      Iyappanthangal
                    ...
5009                         Korattur
5010                         Ambattur
5011    Pallikaranai VGP Shanti Nagar
5012                         Korattur
5013                         Selaiyur
Name: location, Length: 5014, dtype: object

In [23]:
location_count = data['location'].value_counts()

In [24]:
location_count

Medavakkam              230
Ambattur                195
Sholinganallur          177
Karapakkam              161
Iyappanthangal          158
                       ...
Shenoy Nagar              1
Irandankattalai           1
200 Feet Radial Road      1
Shanthi Nagar             1
Royapuram                 1
Name: location, Length: 185, dtype: int64

In [25]:
location_count_less_10 = location_count[location_count <= 10]
location_count_less_10

Thaiyur                 10
Vanagaram               10
Periyapanicheri         10
Siruseri                 9
Urapakkam                9
                        ..
Shenoy Nagar             1
Irandankattalai          1
200 Feet Radial Road     1
Shanthi Nagar            1
Royapuram                1
Name: location, Length: 99, dtype: int64

In [26]:
data['location'] = data['location'].apply(lambda x: 'Other' if x in location_count_less_10 else x)

In [27]:
data['location'].value_counts()

Other              342
Medavakkam         230
Ambattur           195
Sholinganallur     177
Karapakkam         161
                  ...
West Tambaram       12
Peerakankaranai     12
Koyambedu           12
Gowrivakkam         12
Kotturpuram         11
Name: location, Length: 87, dtype: int64

# Outliers Detection and Removal

In [28]:
(data['sqft'] / data['bhk']).describe()

count    5014.000000
mean      536.921571
std       382.631975
min        57.937500
25%       304.666667
50%       433.333333
75%       630.833333
max      5777.000000
dtype: float64

In [29]:
data = data[((data['sqft']/data['bhk']) >= 300)]
data.describe()

             price         sqft    bathrooms          bhk
count  3831.000000  3831.000000  3831.000000  3831.000000
mean     95.164782  1370.213782     2.738449     2.413469
std     107.269872   669.260028     1.514415     0.802585
min      20.000000   450.000000     1.000000     1.000000
25%      45.345000   975.000000     2.000000     2.000000
50%      63.890000  1200.000000     2.000000     2.000000
75%      96.130000  1562.500000     3.000000     3.000000
max    1900.000000  7240.000000    40.000000     6.000000

In [30]:
data.shape

(3831, 6)

In [31]:
data.price.describe()

count    3831.000000
mean       95.164782
std       107.269872
min        20.000000
25%        45.345000
50%        63.890000
75%        96.130000
max      1900.000000
Name: price, dtype: float64

In [32]:
def remove_outliers_sqft(df):
    df_output = pd.DataFrame()
    for key,subdf in df.groupby('location'):
        m = np.mean(subdf.price)
        st = np.std(subdf.price)
        gen_df = subdf[(subdf.price > (m-st)) & (subdf.price <= (m+st))]
        df_output = pd.concat([df_output,gen_df],ignore_index =True)
    return df_output
data = remove_outliers_sqft(data)
data.describe()

             price         sqft    bathrooms          bhk
count  3193.000000  3193.000000  3193.000000  3193.000000
mean     76.618678  1305.331976     2.735672     2.398371
std      59.178250   578.199730     1.537634     0.796545
min      20.000000   450.000000     1.000000     1.000000
25%      45.360000   960.000000     2.000000     2.000000
50%      61.640000  1168.000000     2.000000     2.000000
75%      84.740000  1498.000000     3.000000     3.000000
max     630.000000  7200.000000    40.000000     6.000000

In [33]:
def bhk_outlier_remover(df):
    exclude_indices = np.array([])
    for location, loc_df in df.groupby('location'):
        bhk_stats = {}
        for bhk, bhk_df in loc_df.groupby('bhk'):
            bhk_stats[bhk] = {
                'mean': np.mean(bhk_df.price),
                'std': np.std(bhk_df.price),
                'count': bhk_df.shape[0]
            }
        for bhk, bhk_df in loc_df.groupby('bhk'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices = np.append(exclude_indices, bhk_df[bhk_df.price<(stats['mean'])].index.values)
    return df.drop(exclude_indices,axis='index')

In [34]:
data = bhk_outlier_remover(data)

In [35]:
data.shape

(2079, 6)

In [36]:
data

          price  sqft       location  bathrooms  bhk            area_type
0      80.00000  1000     Adambakkam        2.0    3            Plot Area
1     100.00000  1293     Adambakkam        2.0    4  Super built-up Area
2      55.00000  1000     Adambakkam        2.0    2  Super built-up Area
3      66.81999   956     Adambakkam        3.0    2        Built-up Area
4      80.00000   995     Adambakkam        2.0    3  Super built-up Area
...         ...   ...            ...        ...  ...                  ...
3188   60.50000   772  tambaram west        3.0    2  Super built-up Area
3189   63.66000  1270  tambaram west        5.0    1        Built-up Area
3190   54.76000  1000  tambaram west        5.0    3            Plot Area
3191   51.00000   750  tambaram west        2.0    2  Super built-up Area
3192   45.49000   700  tambaram west        1.0    1  Super built-up Area

[2079 rows x 6 columns]

# Cleaned Data

In [37]:
data.drop(columns=['area_type'],inplace=True)
data.head()

       price  sqft    location  bathrooms  bhk
0   80.00000  1000  Adambakkam        2.0    3
1  100.00000  1293  Adambakkam        2.0    4
2   55.00000  1000  Adambakkam        2.0    2
3   66.81999   956  Adambakkam        3.0    2
4   80.00000   995  Adambakkam        2.0    3

In [38]:
data.to_csv("Chennai_Cleaned_data.csv")

In [39]:
X = data.drop(columns=['price'])
y = data['price']

In [40]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression,Lasso,Ridge
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [41]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.2, random_state=0)

In [42]:
print(X_train.shape)
print(X_test.shape)

(1663, 4)
(416, 4)

# Applying Linear Regression

In [43]:
column_trans = make_column_transformer((OneHotEncoder(sparse=False), ['location']),remainder='passthrough')

In [44]:
scaler = StandardScaler()

In [45]:
lr = LinearRegression(normalize=True)

In [46]:
pipe = make_pipeline(column_trans,scaler,lr)

In [47]:
pipe.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()),
                ('linearregression', LinearRegression(normalize=True))])

In [48]:
y_pred_lr = pipe.predict(X_test)

In [49]:
r2_score(y_test, y_pred_lr)

0.6845282771877519

# Applying Lasso

In [50]:
lasso = Lasso()

In [51]:
pipe = make_pipeline(column_trans, scaler, lasso)

In [52]:
pipe.fit(X_train, y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('lasso', Lasso())])

In [53]:
y_pred_lasso = pipe.predict(X_test)

In [54]:
r2_score(y_test, y_pred_lasso)

0.6889155093952022

# Applying Ridge

In [55]:
ridge = Ridge()

In [56]:
pipe = make_pipeline(column_trans, scaler, ridge)

In [57]:
pipe.fit(X_train, y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('ridge', Ridge())])

In [58]:
y_pred_ridge = pipe.predict(X_test)

In [59]:
r2_score(y_test, y_pred_ridge)

0.6876673179430308

In [60]:
print("Linear Regression: ", r2_score(y_test, y_pred_lr))
print("Lasso: ", r2_score(y_test, y_pred_lasso))
print("Ridge: ", r2_score(y_test, y_pred_ridge))

Linear Regression:  0.6845282771877519
Lasso:  0.6889155093952022
Ridge:  0.6876673179430308

In [61]:
import pickle

In [62]:
pickle.dump(pipe, open('ChennaiRidgeModel.pkl', 'wb'))